Revit 2027 API
BuiltInFailures.StairRampFailures.WinderRunWidthOrMinWidthOrTooShortFailure Property
 The parameter runwidth is too great or the parameter min width at inside boundary is too great, or one leg of winder run is too short.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WinderRunWidthOrMinWidthOrTooShortFailure { get; }
Public Shared ReadOnly Property WinderRunWidthOrMinWidthOrTooShortFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WinderRunWidthOrMinWidthOrTooShortFailure {
	FailureDefinitionId^ get ();
}
static member WinderRunWidthOrMinWidthOrTooShortFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace